Revit.Elements.Parameter.Value
Get the value of the parameter

Revit.Elements.Parameter.HasValue
Check if the Parameter has a value

Revit.Elements.Parameter.IsReadOnly
Check if the Parameter is read only

Revit.Elements.Parameter.IsShared
Check if the Parameter is shared

Revit.Elements.Parameter.Group
Get the parameter's group

Revit.Elements.Parameter.ParameterType
Get the parameter type

Revit.Elements.Parameter.Id
Get the parameter's element Id

Revit.Elements.Parameter.UnitType
Get the parameter's unit type

Revit.Elements.Parameter.ParameterByName(Revit.Elements.Element,System.String)
Get Element's Parameter by Name
element: Element
name: Parameter Name
Returns: Parameter

Revit.Elements.Parameter.SetValue(Revit.Elements.Parameter,System.Object)
Set the value of the parameter

Revit.Elements.Parameter.StorageType
Get Parameter Storage Type

Revit.Elements.Parameter.SharedParameterFile
Gets the path to the shared parameter file of this document
Returns:

Revit.Elements.Parameter.CreateSharedParameterForAllCategories(System.String,System.String,System.String,System.String,System.Boolean)
Create a new Shared Parameter in the current Revit document for all applicable categories
parameterName: Name
groupName: Group of the parameter for shared parameters
type: Parameter Type
group: Parameter Group
instance: Is instance parameter, otherwise it's a type parameter

Revit.Elements.Parameter.CreateSharedParameter(System.String,System.String,System.String,System.String,System.Boolean,System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Create a new Shared Parameter in the current Revit document
parameterName: Name
groupName: Group of the parameter for shared parameters
type: Parameter Type
group: Parameter Group
instance: Is instance parameter, otherwise it's a type parameter
categoryList: List of categories this parameter applies to, If no category is supplied, all possible categories are selected

Revit.Elements.Parameter.CreateProjectParameterForAllCategories(System.String,System.String,System.String,System.String,System.Boolean)
Create a new Project Parameter in this current Revit document for all applicable categories
parameterName: Name
groupName: Group of the parameter for shared parameters
type: Parameter Type
group: Parameter Group
instance: Is instance parameter, otherwise it's a type parameter

Revit.Elements.Parameter.CreateProjectParameter(System.String,System.String,System.String,System.String,System.Boolean,System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Create a new Project Parameter in this current Revit document
parameterName: Name
groupName: Group of the parameter for shared parameters
type: Parameter Type
group: Parameter Group
instance: Is instance parameter, otherwise it's a type parameter
categoryList: List of categories this parameter applies to. If no category is supplied, all possible categories are selected

Revit.Elements.Parameter.AllCategories
Get a CategorySet for all categories
Returns:

Revit.Elements.Parameter.ToCategorySet(System.Collections.Generic.IEnumerable{Revit.Elements.Category})
Convert a list of categories to a category set
categoryList:
Returns: